__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 502, 502, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 502, 502, 64) 640         input_1[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 502, 502, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 502, 502, 64) 36928       lambda_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 502, 502, 64) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 502, 502, 64) 36928       lambda_2[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 502, 502, 64) 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 502, 502, 64) 0           lambda_3[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 128, 128, 64) 0           lambda_4[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 64) 36928       lambda_5[0][0]                   
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 1, 1, 64)     0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 1, 1, 4)      260         lambda_6[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 1, 1, 64)     320         conv2d_5[0][0]                   
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 502, 502, 64) 0           lambda_3[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 502, 502, 64) 0           multiply_1[0][0]                 
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 502, 502, 64) 36928       add_1[0][0]                      
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 502, 502, 64) 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 502, 502, 64) 36928       lambda_7[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 502, 502, 64) 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 502, 502, 64) 0           lambda_8[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 128, 128, 64) 0           lambda_9[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 128, 128, 64) 36928       lambda_10[0][0]                  
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 1, 1, 64)     0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 1, 1, 4)      260         lambda_11[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 1, 64)     320         conv2d_10[0][0]                  
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 502, 502, 64) 0           lambda_8[0][0]                   
                                                                 conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 502, 502, 64) 0           multiply_2[0][0]                 
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 502, 502, 64) 36928       add_2[0][0]                      
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 502, 502, 64) 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 502, 502, 64) 36928       lambda_12[0][0]                  
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 502, 502, 64) 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 502, 502, 64) 0           lambda_13[0][0]                  
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 128, 128, 64) 0           lambda_14[0][0]                  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 128, 128, 64) 36928       lambda_15[0][0]                  
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 1, 1, 64)     0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 1, 1, 4)      260         lambda_16[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 1, 1, 64)     320         conv2d_15[0][0]                  
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 502, 502, 64) 0           lambda_13[0][0]                  
                                                                 conv2d_16[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 502, 502, 64) 0           multiply_3[0][0]                 
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 502, 502, 64) 36928       add_3[0][0]                      
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 502, 502, 64) 0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 502, 502, 64) 36928       lambda_17[0][0]                  
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 502, 502, 64) 0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 502, 502, 64) 0           lambda_18[0][0]                  
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 128, 128, 64) 0           lambda_19[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 128, 128, 64) 36928       lambda_20[0][0]                  
__________________________________________________________________________________________________
lambda_21 (Lambda)              (None, 1, 1, 64)     0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 1, 1, 4)      260         lambda_21[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 1, 1, 64)     320         conv2d_20[0][0]                  
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 502, 502, 64) 0           lambda_18[0][0]                  
                                                                 conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 502, 502, 64) 0           multiply_4[0][0]                 
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
add_5 (Add)                     (None, 502, 502, 64) 0           add_4[0][0]                      
                                                                 lambda_1[0][0]                   
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 502, 502, 64) 36928       add_5[0][0]                      
__________________________________________________________________________________________________
lambda_22 (Lambda)              (None, 502, 502, 64) 0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 502, 502, 64) 36928       lambda_22[0][0]                  
__________________________________________________________________________________________________
lambda_23 (Lambda)              (None, 502, 502, 64) 0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
lambda_24 (Lambda)              (None, 502, 502, 64) 0           lambda_23[0][0]                  
__________________________________________________________________________________________________
lambda_25 (Lambda)              (None, 128, 128, 64) 0           lambda_24[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 128, 128, 64) 36928       lambda_25[0][0]                  
__________________________________________________________________________________________________
lambda_26 (Lambda)              (None, 1, 1, 64)     0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 1, 1, 4)      260         lambda_26[0][0]                  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 1, 1, 64)     320         conv2d_25[0][0]                  
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, 502, 502, 64) 0           lambda_23[0][0]                  
                                                                 conv2d_26[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 502, 502, 64) 0           multiply_5[0][0]                 
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 502, 502, 64) 36928       add_6[0][0]                      
__________________________________________________________________________________________________
lambda_27 (Lambda)              (None, 502, 502, 64) 0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 502, 502, 64) 36928       lambda_27[0][0]                  
__________________________________________________________________________________________________
lambda_28 (Lambda)              (None, 502, 502, 64) 0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
lambda_29 (Lambda)              (None, 502, 502, 64) 0           lambda_28[0][0]                  
__________________________________________________________________________________________________
lambda_30 (Lambda)              (None, 128, 128, 64) 0           lambda_29[0][0]                  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 128, 128, 64) 36928       lambda_30[0][0]                  
__________________________________________________________________________________________________
lambda_31 (Lambda)              (None, 1, 1, 64)     0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 1, 1, 4)      260         lambda_31[0][0]                  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 1, 1, 64)     320         conv2d_30[0][0]                  
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, 502, 502, 64) 0           lambda_28[0][0]                  
                                                                 conv2d_31[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 502, 502, 64) 0           multiply_6[0][0]                 
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 502, 502, 64) 36928       add_7[0][0]                      
__________________________________________________________________________________________________
lambda_32 (Lambda)              (None, 502, 502, 64) 0           conv2d_32[0][0]                  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 502, 502, 64) 36928       lambda_32[0][0]                  
__________________________________________________________________________________________________
lambda_33 (Lambda)              (None, 502, 502, 64) 0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
lambda_34 (Lambda)              (None, 502, 502, 64) 0           lambda_33[0][0]                  
__________________________________________________________________________________________________
lambda_35 (Lambda)              (None, 128, 128, 64) 0           lambda_34[0][0]                  
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 128, 128, 64) 36928       lambda_35[0][0]                  
__________________________________________________________________________________________________
lambda_36 (Lambda)              (None, 1, 1, 64)     0           conv2d_34[0][0]                  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 1, 1, 4)      260         lambda_36[0][0]                  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 1, 1, 64)     320         conv2d_35[0][0]                  
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, 502, 502, 64) 0           lambda_33[0][0]                  
                                                                 conv2d_36[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 502, 502, 64) 0           multiply_7[0][0]                 
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 502, 502, 64) 36928       add_8[0][0]                      
__________________________________________________________________________________________________
lambda_37 (Lambda)              (None, 502, 502, 64) 0           conv2d_37[0][0]                  
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 502, 502, 64) 36928       lambda_37[0][0]                  
__________________________________________________________________________________________________
lambda_38 (Lambda)              (None, 502, 502, 64) 0           conv2d_38[0][0]                  
__________________________________________________________________________________________________
lambda_39 (Lambda)              (None, 502, 502, 64) 0           lambda_38[0][0]                  
__________________________________________________________________________________________________
lambda_40 (Lambda)              (None, 128, 128, 64) 0           lambda_39[0][0]                  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 128, 128, 64) 36928       lambda_40[0][0]                  
__________________________________________________________________________________________________
lambda_41 (Lambda)              (None, 1, 1, 64)     0           conv2d_39[0][0]                  
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 1, 1, 4)      260         lambda_41[0][0]                  
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 1, 1, 64)     320         conv2d_40[0][0]                  
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, 502, 502, 64) 0           lambda_38[0][0]                  
                                                                 conv2d_41[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 502, 502, 64) 0           multiply_8[0][0]                 
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
add_10 (Add)                    (None, 502, 502, 64) 0           add_9[0][0]                      
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 502, 502, 64) 36928       add_10[0][0]                     
__________________________________________________________________________________________________
lambda_42 (Lambda)              (None, 502, 502, 64) 0           conv2d_42[0][0]                  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 502, 502, 64) 36928       lambda_42[0][0]                  
__________________________________________________________________________________________________
lambda_43 (Lambda)              (None, 502, 502, 64) 0           conv2d_43[0][0]                  
__________________________________________________________________________________________________
lambda_44 (Lambda)              (None, 502, 502, 64) 0           lambda_43[0][0]                  
__________________________________________________________________________________________________
lambda_45 (Lambda)              (None, 128, 128, 64) 0           lambda_44[0][0]                  
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 128, 128, 64) 36928       lambda_45[0][0]                  
__________________________________________________________________________________________________
lambda_46 (Lambda)              (None, 1, 1, 64)     0           conv2d_44[0][0]                  
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 1, 1, 4)      260         lambda_46[0][0]                  
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 1, 1, 64)     320         conv2d_45[0][0]                  
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, 502, 502, 64) 0           lambda_43[0][0]                  
                                                                 conv2d_46[0][0]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 502, 502, 64) 0           multiply_9[0][0]                 
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 502, 502, 64) 36928       add_11[0][0]                     
__________________________________________________________________________________________________
lambda_47 (Lambda)              (None, 502, 502, 64) 0           conv2d_47[0][0]                  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 502, 502, 64) 36928       lambda_47[0][0]                  
__________________________________________________________________________________________________
lambda_48 (Lambda)              (None, 502, 502, 64) 0           conv2d_48[0][0]                  
__________________________________________________________________________________________________
lambda_49 (Lambda)              (None, 502, 502, 64) 0           lambda_48[0][0]                  
__________________________________________________________________________________________________
lambda_50 (Lambda)              (None, 128, 128, 64) 0           lambda_49[0][0]                  
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 128, 128, 64) 36928       lambda_50[0][0]                  
__________________________________________________________________________________________________
lambda_51 (Lambda)              (None, 1, 1, 64)     0           conv2d_49[0][0]                  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 1, 1, 4)      260         lambda_51[0][0]                  
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 1, 1, 64)     320         conv2d_50[0][0]                  
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, 502, 502, 64) 0           lambda_48[0][0]                  
                                                                 conv2d_51[0][0]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 502, 502, 64) 0           multiply_10[0][0]                
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 502, 502, 64) 36928       add_12[0][0]                     
__________________________________________________________________________________________________
lambda_52 (Lambda)              (None, 502, 502, 64) 0           conv2d_52[0][0]                  
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 502, 502, 64) 36928       lambda_52[0][0]                  
__________________________________________________________________________________________________
lambda_53 (Lambda)              (None, 502, 502, 64) 0           conv2d_53[0][0]                  
__________________________________________________________________________________________________
lambda_54 (Lambda)              (None, 502, 502, 64) 0           lambda_53[0][0]                  
__________________________________________________________________________________________________
lambda_55 (Lambda)              (None, 128, 128, 64) 0           lambda_54[0][0]                  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 128, 128, 64) 36928       lambda_55[0][0]                  
__________________________________________________________________________________________________
lambda_56 (Lambda)              (None, 1, 1, 64)     0           conv2d_54[0][0]                  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 1, 1, 4)      260         lambda_56[0][0]                  
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 1, 1, 64)     320         conv2d_55[0][0]                  
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, 502, 502, 64) 0           lambda_53[0][0]                  
                                                                 conv2d_56[0][0]                  
__________________________________________________________________________________________________
add_13 (Add)                    (None, 502, 502, 64) 0           multiply_11[0][0]                
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 502, 502, 64) 36928       add_13[0][0]                     
__________________________________________________________________________________________________
lambda_57 (Lambda)              (None, 502, 502, 64) 0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 502, 502, 64) 36928       lambda_57[0][0]                  
__________________________________________________________________________________________________
lambda_58 (Lambda)              (None, 502, 502, 64) 0           conv2d_58[0][0]                  
__________________________________________________________________________________________________
lambda_59 (Lambda)              (None, 502, 502, 64) 0           lambda_58[0][0]                  
__________________________________________________________________________________________________
lambda_60 (Lambda)              (None, 128, 128, 64) 0           lambda_59[0][0]                  
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 128, 128, 64) 36928       lambda_60[0][0]                  
__________________________________________________________________________________________________
lambda_61 (Lambda)              (None, 1, 1, 64)     0           conv2d_59[0][0]                  
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 1, 1, 4)      260         lambda_61[0][0]                  
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 1, 1, 64)     320         conv2d_60[0][0]                  
__________________________________________________________________________________________________
multiply_12 (Multiply)          (None, 502, 502, 64) 0           lambda_58[0][0]                  
                                                                 conv2d_61[0][0]                  
__________________________________________________________________________________________________
add_14 (Add)                    (None, 502, 502, 64) 0           multiply_12[0][0]                
                                                                 add_13[0][0]                     
__________________________________________________________________________________________________
add_15 (Add)                    (None, 502, 502, 64) 0           add_14[0][0]                     
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 502, 502, 64) 36928       add_15[0][0]                     
__________________________________________________________________________________________________
lambda_62 (Lambda)              (None, 502, 502, 64) 0           conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 502, 502, 64) 36928       lambda_62[0][0]                  
__________________________________________________________________________________________________
lambda_63 (Lambda)              (None, 502, 502, 64) 0           conv2d_63[0][0]                  
__________________________________________________________________________________________________
lambda_64 (Lambda)              (None, 502, 502, 64) 0           lambda_63[0][0]                  
__________________________________________________________________________________________________
lambda_65 (Lambda)              (None, 128, 128, 64) 0           lambda_64[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 128, 128, 64) 36928       lambda_65[0][0]                  
__________________________________________________________________________________________________
lambda_66 (Lambda)              (None, 1, 1, 64)     0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 1, 1, 4)      260         lambda_66[0][0]                  
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 1, 1, 64)     320         conv2d_65[0][0]                  
__________________________________________________________________________________________________
multiply_13 (Multiply)          (None, 502, 502, 64) 0           lambda_63[0][0]                  
                                                                 conv2d_66[0][0]                  
__________________________________________________________________________________________________
add_16 (Add)                    (None, 502, 502, 64) 0           multiply_13[0][0]                
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 502, 502, 64) 36928       add_16[0][0]                     
__________________________________________________________________________________________________
lambda_67 (Lambda)              (None, 502, 502, 64) 0           conv2d_67[0][0]                  
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 502, 502, 64) 36928       lambda_67[0][0]                  
__________________________________________________________________________________________________
lambda_68 (Lambda)              (None, 502, 502, 64) 0           conv2d_68[0][0]                  
__________________________________________________________________________________________________
lambda_69 (Lambda)              (None, 502, 502, 64) 0           lambda_68[0][0]                  
__________________________________________________________________________________________________
lambda_70 (Lambda)              (None, 128, 128, 64) 0           lambda_69[0][0]                  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 128, 128, 64) 36928       lambda_70[0][0]                  
__________________________________________________________________________________________________
lambda_71 (Lambda)              (None, 1, 1, 64)     0           conv2d_69[0][0]                  
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 1, 1, 4)      260         lambda_71[0][0]                  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 1, 1, 64)     320         conv2d_70[0][0]                  
__________________________________________________________________________________________________
multiply_14 (Multiply)          (None, 502, 502, 64) 0           lambda_68[0][0]                  
                                                                 conv2d_71[0][0]                  
__________________________________________________________________________________________________
add_17 (Add)                    (None, 502, 502, 64) 0           multiply_14[0][0]                
                                                                 add_16[0][0]                     
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 502, 502, 64) 36928       add_17[0][0]                     
__________________________________________________________________________________________________
lambda_72 (Lambda)              (None, 502, 502, 64) 0           conv2d_72[0][0]                  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 502, 502, 64) 36928       lambda_72[0][0]                  
__________________________________________________________________________________________________
lambda_73 (Lambda)              (None, 502, 502, 64) 0           conv2d_73[0][0]                  
__________________________________________________________________________________________________
lambda_74 (Lambda)              (None, 502, 502, 64) 0           lambda_73[0][0]                  
__________________________________________________________________________________________________
lambda_75 (Lambda)              (None, 128, 128, 64) 0           lambda_74[0][0]                  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 128, 128, 64) 36928       lambda_75[0][0]                  
__________________________________________________________________________________________________
lambda_76 (Lambda)              (None, 1, 1, 64)     0           conv2d_74[0][0]                  
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 1, 1, 4)      260         lambda_76[0][0]                  
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 1, 1, 64)     320         conv2d_75[0][0]                  
__________________________________________________________________________________________________
multiply_15 (Multiply)          (None, 502, 502, 64) 0           lambda_73[0][0]                  
                                                                 conv2d_76[0][0]                  
__________________________________________________________________________________________________
add_18 (Add)                    (None, 502, 502, 64) 0           multiply_15[0][0]                
                                                                 add_17[0][0]                     
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 502, 502, 64) 36928       add_18[0][0]                     
__________________________________________________________________________________________________
lambda_77 (Lambda)              (None, 502, 502, 64) 0           conv2d_77[0][0]                  
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 502, 502, 64) 36928       lambda_77[0][0]                  
__________________________________________________________________________________________________
lambda_78 (Lambda)              (None, 502, 502, 64) 0           conv2d_78[0][0]                  
__________________________________________________________________________________________________
lambda_79 (Lambda)              (None, 502, 502, 64) 0           lambda_78[0][0]                  
__________________________________________________________________________________________________
lambda_80 (Lambda)              (None, 128, 128, 64) 0           lambda_79[0][0]                  
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 128, 128, 64) 36928       lambda_80[0][0]                  
__________________________________________________________________________________________________
lambda_81 (Lambda)              (None, 1, 1, 64)     0           conv2d_79[0][0]                  
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 1, 1, 4)      260         lambda_81[0][0]                  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 1, 1, 64)     320         conv2d_80[0][0]                  
__________________________________________________________________________________________________
multiply_16 (Multiply)          (None, 502, 502, 64) 0           lambda_78[0][0]                  
                                                                 conv2d_81[0][0]                  
__________________________________________________________________________________________________
add_19 (Add)                    (None, 502, 502, 64) 0           multiply_16[0][0]                
                                                                 add_18[0][0]                     
__________________________________________________________________________________________________
add_20 (Add)                    (None, 502, 502, 64) 0           add_19[0][0]                     
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 502, 502, 256 147712      add_20[0][0]                     
__________________________________________________________________________________________________
lambda_82 (Lambda)              (None, 502, 502, 256 0           conv2d_82[0][0]                  
__________________________________________________________________________________________________
lambda_83 (Lambda)              (None, 1004, 1004, 6 0           lambda_82[0][0]                  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 1004, 1004, 1 577         lambda_83[0][0]                  
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 1004, 1004, 1 0           conv2d_83[0][0]                  
==================================================================================================
Total params: 1,930,753
Trainable params: 1,930,753
Non-trainable params: 0
__________________________________________________________________________________________________
